miniproject0/case6/2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (5 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    wallL
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wallR
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wallExpansion
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    twoD
    {
        type            empty;
    }
}


// ************************************************************************* //
