miniproject0/case6/2/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.1;
    }
    
    outlet
    {
        type            zeroGradient;
    }
      
    wallL
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    wallR
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    wallExpansion
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    
    twoD
    {
        type            empty;
    }
}


// ************************************************************************* //
